Autodesk.Navisworks.Api.Plugins.FileProtocolOpenMode
Open mode for FileProtocolPlugin interface.

Autodesk.Navisworks.Api.Plugins.FileProtocolOpenMode.Read
Open for read

Autodesk.Navisworks.Api.Plugins.FileProtocolOpenMode.Write
Open for write